# OriginOffsetX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..OriginOffsetX Property
PDFExportOptions Class See Also
---
Offset between left sides of pdf content and paper. Always stored in unit of Feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double OriginOffsetX { get; set; }
```

Visual Basic
---
```text
Public Property OriginOffsetX As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double OriginOffsetX {
	double get ();
	void set (double value);
}
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace